// PR_2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "RU");
    int a[100], n, i_mx = -1, i_mn = -1;
    cout << "n? ";
    cin >> n;
    for (int i = 0; i < n; i++)cin >> a[i];
    for (int i = 0; i < n; i++) {
        if (a[i] >= 0) {
            i_mx = i;
            break;
        }
    }
    for (int i = n - 1; i >= 0; i--) {
        if (a[i] <= 0) {
            i_mn = i;
            break;
        }
    }

    if(n < 2 || i_mx == -1 || i_mn == -1){
        cout << "Ошибка";
        return 0;
    }


    for (int i = 0; i < n - i_mn; i++) a[i + 1 + i_mx] = a[i + i_mn];
    for (int i = i_mx + n - i_mn + 1; i < n; i++)a[i] = 0;
    cout << "Получившийся массив:\n";
    for (int i = 0; i < n - (i_mn - i_mx - 1); i++)cout << a[i] << " ";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
