// PR_3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{

    int a[100][50], cols[50];
    int n, m, ans = 0;
    cout << "n, m? ";
    cin >> n >> m;
    for (int i = 0; i < m; i++)cols[i] = 0;
    
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++) {
            cin >> a[i][j];
            cols[j] += a[i][j];
        }
    }
    //for (int i = 0; i < m; i++)cout << cols[i] << " ";
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++) {
            if (a[i][j] > cols[j])ans++;
        }
    }
    cout << ans;
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
