// PR_7.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#define _USE_MATH_DEFINES
#include <iostream>
#include <cmath>
using namespace std;

double method(double a, double b, double eps, double(*f)(double x)) {
    float x, z, n = 4, h;
    h = (b - a) / n;
    z = h / 4;
    x = 2 * z * (7 * f(a) + 32 * f(a + z) + 12 * f(a + 2*z) + 32 * f(a + 3*z) + 7 * f(a + 4*z)) / 45;

    return x;
}

double f(double x) {
    return sin(M_PI * x * x / 2);
}

int main()
{
    float a = 0, b, eps;
    cout << "eps?\n";
    cin >> eps;
    b = 0.5; //, 1.0, 1.5, 2.0;
    cout << method(a, b, eps, f);
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
